Revit 2026 API

# TemporaryViewModesPreviewFamilyVisibility Property

---

The current state of the PreviewFamilyVisibility mode in the associated view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PreviewFamilyVisibilityMode PreviewFamilyVisibility { get; set; }
```
```vb
Public Property PreviewFamilyVisibility As PreviewFamilyVisibilityMode
	Get
	Set
```
```cpp
public:
property PreviewFamilyVisibilityMode PreviewFamilyVisibility {
	PreviewFamilyVisibilityMode get ();
	void set (PreviewFamilyVisibilityMode value);
}
```
```fsharp
member PreviewFamilyVisibility : PreviewFamilyVisibilityMode with get, set
```

#### Property Value

PreviewFamilyVisibilityMode

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given PreviewFamilyVisibilityMode is not applicable in the associated view. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | When setting this property: The PreviewFamilyVisibility mode is either disabled or inapplicable in the associated view. |

The state of the PreviewFamilyVisibility mode can be set only if the mode is currently available and enabled in the view. Even in such a condition, however, not all states are valid in all views. To ensure that the state to be applied is valid in the view, call the IsValidState(PreviewFamilyVisibilityMode) method first.

Even views which generally support temporary modes will have this particular mode available only when the document of the view is in the environment of the family editor.

This property affect only the view associated with this instance of TemporaryViewModes. When a view is opened for the first time, its state of the PreviewFamilyVisibility mode is determined based on the default settings which is controlled through the properties PreviewFamilyVisibilityDefaultOnState and PreviewFamilyVisibilityDefaultUncutState.

#### Reference

TemporaryViewModes Class

Autodesk.Revit.DB Namespace